app/controllers/api/v1/deposits_controller.rb

INSERT INTO "deposits" ("tradeline_id", "deposit_date", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["tradeline_id", 1], ["deposit_date", "2024-03-29"], ["amount", 100.0], ["created_at", "2024-03-28 01:22:30.196341"], ["updated_at", "2024-03-28 01:22:30.196341"]]
INSERT INTO "tradelines" ("name", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Some Credit Card"], ["amount", 3223.54], ["created_at", "2024-03-28 01:16:03.406394"], ["updated_at", "2024-03-28 01:16:03.406394"]]
---
  def create
    deposit = @tradeline.deposits.new(deposit_params)
    # require "pry"; binding.pry
    if deposit.save

SELECT "tradelines".* FROM "tradelines" WHERE (43) LIMIT ?  [["LIMIT", 1]]
---
  def set_tradeline
    @tradeline = Tradeline.find_by(params[:tradeline_id])