app/controllers/api/v1/tradelines_controller.rb

  def set_tradelines
    @tradelines = Tradeline.all
---
SELECT "tradelines".* FROM "tradelines"

  def set_tradeline
    @tradeline = Tradeline.find(params[:id])
---
SELECT "tradelines".* FROM "tradelines" WHERE "tradelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]